# FaceSculptEditFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SculptingFailures..::..FaceSculptEditFailed Property
BuiltInFailures..::..SculptingFailures Class See Also
---
Face Sculpt Edit failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceSculptEditFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceSculptEditFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceSculptEditFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SculptingFailures Class
Autodesk.Revit.DB Namespace